[
    {
        "postId": 1,
        "author": {
            "name": "Janser",
            "avatar": "https://images.pexels.com/photos/771742/pexels-photo-771742.jpeg?auto=compress&cs=tinysrgb&dpr=1&w=500",
            "postDate": "2027-10-19"
        },
        "image": "pics/post1.JPG",
        "content": "The winning BMW 320D11 in the 24-Hour race 1998 on the Nürburgring.",
        "likes": 110,
        "comments": 5
    },
    {
        "postId": 2,
        "author": {
            "name": "User",
            "avatar": "pics/user.png",
            "postDate": "2027-10-19"
        },
        "content": "Founded in 1916, BMW (Bayerische Motoren Werke) began as a manufacturer of aircraft engines before pivoting to motorcycles in 1923 and then automobiles in 1928 with the BMW 3/15. Renowned for its commitment to performance and luxury, BMW became iconic with models like the 328 sports car and the 2002. The brand's slogan, \"The Ultimate Driving Machine,\" encapsulates its legacy of engineering excellence. Today, BMW continues to innovate, leading the way in electric mobility with its i series while remaining a symbol of quality and driving pleasure.",
        "likes": 8,
        "comments": 3
    },
    {
        "postId": 3,
        "author": {
            "name": "User",
            "avatar": "pics/user.png",
            "postDate": "2027-10-20"
        },
        "image": "pics/post2.jpg",
        "content": "The BMW E30, produced from 1982 to 1994, is a classic compact executive car that is highly regarded among enthusiasts. Part of the BMW 3 Series, it features a distinctive boxy design and rear-wheel drive, offering a range of engines, from economical four-cylinders to powerful six-cylinder options. The E30 M3, in particular, is celebrated for its high-revving 2.3-liter inline-four engine and motorsport heritage. Known for its balanced handling and solid build quality, the E30 remains a beloved classic, with a strong aftermarket scene for restoration and modification. Its combination of sportiness and practicality continues to attract admirers today.",
        "likes": 300,
        "comments": 9
    },
    {
        "postId": 4,
        "author": {
            "name": "User",
            "avatar": "pics/user.png",
            "postDate": "2027-10-20"
        },
        "image": "pics/post3.jpg",
        "content": "This is my 2001 525i e39. It may not be the prettiest, but it has a strong aura. :P",
        "likes": 69,
        "comments": 0
    },
    {
        "postId": 5,
        "author": {
            "name": "User",
            "avatar": "pics/user.png",
            "postDate": "2027-10-22"
        },
        "content": "WOW!!!! I AM IN LOVE WITH THIS SITE!!! AMAZING CARS!!",
        "likes": 6969,
        "comments": 1
    }
]
